
const 西奥迪尼社会心理学=
["202204251.适应性特质","2022042510.因变量","20220425100.平衡理论","20220425101.说服的中心路径","20220425102.认知失调","20220425103.认知反应模型","20220425104.一致性原则","20220425105.反驳论据","20220425106.反态度行为","20220425107.说服的双加工模型","20220425108.精细加工可能性模型","20220425109.印象动机","2022042511.描述法","20220425110.接种程序","20220425111.认知需求","20220425112.非反应性测量","20220425113.说服的外周路径","20220425114.说服","20220425115.决策后失调","20220425116.计划行为理论","20220425117.诱饵掉包技术","20220425118.顺从","20220425119.从众","2022042512.进化论视角","20220425120.示范性规范","20220425121.中断再构造技术","20220425122.留面子技术","20220425123.专家权利","20220425124.登门槛技术","20220425125.禁止性规范","20220425126.标记技术","20220425127.低球技术","20220425128.互惠规范","20220425129.服从","2022042513.实验","20220425130.参与性观察","20220425131.个人承诺","20220425132.拒绝理论","20220425133.社会影响","20220425134.社会确认","20220425135.折扣技术","20220425136.权利等级","20220425137.群体共享","20220425138.领域一般性模型","20220425139.领域特异性模型","2022042514.实验法","20220425140.平等分配","20220425141.公平","20220425142.经验取样法","20220425143.朋友","20220425144.健康心理学","20220425145.市场定价","20220425146.曝光效应","20220425147.接近吸引原则","20220425148.强化感情模型","20220425149.自我表露","2022042515.外部效应","20220425150.社会资本","20220425151.社会交换","20220425152.社会支持","20220425153.双性化","20220425154.焦虑茅盾型依恋","20220425155.回避性依恋","20220425156.伙伴之爱","20220425157.决定承诺","20220425158.公平规则","20220425159.钟情妄想症","2022042516.现场效应","20220425160.因素分析","20220425161.亲密","20220425162.一夫一妻制","20220425163.以需求为基础的规则","20220425164.归属感的需求","20220425165.激情","20220425166.激情之爱","20220425167.一妻多夫制","20220425168.多配偶制","20220425169.一夫多妻制","2022042517.普遍性","20220425170.安全型依恋","20220425171.安全基地","20220425172.社会性性行为取向","20220425173.爱情双因素理论","20220425174.唤醒成本回报模型","20220425175.旁观者效应","20220425176.责任扩散","20220425177.共情式关怀","20220425178.共情利他假设","20220425179.族内适应性","2022042518.假设","20220425180.心境管理假设","20220425181.个人规范","20220425182.观点采择","20220425183.多数无知","20220425184.亲社会行为","20220425185.纯粹真正的利他主义","20220425186.互惠帮助","20220425187.社会责任规范","20220425188.攻击","20220425189.果敢","2022042519.自变量","20220425190.宣泄","20220425191.认知新联理论","20220425192.荣誉文化","20220425193.防御型归因风格","20220425194.直接攻击","20220425195.置换","20220425196.效果危险比率","20220425197.情绪性攻击","20220425198.兴奋迁移性理论","20220425199.挫折攻击假设最初的","202204252.档案法","2022042520.内部效应","20220425200.挫折攻击假设修订后","20220425201.间接攻击","20220425202.工具性攻击","20220425203.元分析","20220425204.精神变态者","20220425205.相对剥夺","20220425206.性选择","20220425207.社会学习理论","20220425208.A型行为模式","20220425209.武器效应","2022042521.自然选择","20220425210.权威主义","20220425211.歧视","20220425212.去认同化","20220425213.内群体偏见","20220425214.最小化群体间范式","20220425215.知觉到群体外一致性","20220425216.偏见","20220425217.现实群体型冲突理论","20220425218.找替罪羊","20220425219.社会支配倾向","2022042522.自然观察","20220425220.社会身份","20220425221.刻板印象","20220425222.刻板印象威胁","20220425223.刻板印象化","20220425224.凝聚力","20220425225.沟通网络","20220425226.去个体化","20220425227.动态系统","20220425228.群体","20220425229.群体极化","2022042523.观察者偏差","20220425230.群体思维","20220425231.少数人的影响","20220425232.角色","20220425233.社会助长","20220425234.社会懈怠","20220425235.地位层级","20220425236.交互记忆","20220425237.变革性领导","20220425238.利他主义者","20220425239.指令和控制政策","2022042524.个人","20220425240.竞争者","20220425241.冲突螺旋升级论","20220425242.合作者","20220425243.威慑论","20220425244.缓解紧张的渐进与互惠策略","20220425245.个人主义者","20220425246.整合复杂性","20220425247.基于市场的政策","20220425248.知觉困境","20220425249.公共物品困境","2022042525.心理研究","20220425250.可再生资源管理困境","20220425251.贬值强化物","20220425252.社会困境","20220425253.社会陷阱","20220425254.时间序列分析","20220425255.以牙还牙策略","20220425256.志愿策略","20220425257.恐外症","20220425258.临近解释","20220425259.三角分析模式","2022042526.随机分配","20220425260.根本性解释","2022042527.信度","2022042528.代表性样本","2022042529.情景","202204253.个案研究","2022042530.社会认知视角","2022042531.社会赞许型偏差","2022042532.社会学习视角","2022042533.社会规范","2022042534.社会心理学","2022042535.社会文化视角","2022042536.调查法","2022042537.理论","2022042538.效度","2022042539.适宜性","202204254.混淆变量","2022042540.注意","2022042541.态度","2022042542.自动化","2022042543.长期可得","2022042544.集体注主义文化","2022042545.反事实思维","2022042546.示范性规范","2022042547.情绪","2022042548.样例","2022042549.目标","202204255.相关","2022042550.个人主义文化","2022042551.禁止性规范","2022042552.心境","2022042553.动机","2022042554.动机MOTIVE","2022042555.个人情景匹配","2022042556.多数无知","2022042557.启动","2022042558.反射性评价过程","2022042559.图式","202204256.相关系数","2022042560.脚本情景","2022042561.自我概念","2022042562.自尊","2022042563.自我知觉过程","2022042564.自我呈现","2022042565.自我调节","2022042566.社会比较","2022042567.社会化","2022042568.意志力","2022042569.锚定于调整启发式","202204257.文化","2022042570.归因理论","2022042571.扩大原则","2022042572.宜得性启发式","2022042573.对应偏差基本归因错误","2022042574.对应推论理论","2022042575.归因共变模型","2022042576.折扣原则","2022042577.特质推论","2022042578.下行社会比较","2022042579.虚假一致性","202204258.事后解释","2022042580.代表性启发式","2022042581.自我实现预言","2022042582.自利偏差","2022042583.社会认知","2022042584.上行社会比较","2022042585.沾亲带故","2022042586.身体语言","2022042587.胜任动机","2022042588.明哲保身","2022042589.拟剧论","202204259.需求特征","2022042590.逢迎","2022042591.多观众困境","2022042592.公共性自我意识","2022042593.自我妨碍","2022042594.自我监控","2022042595.自我呈现","2022042596.自我推销","2022042597.羞怯","2022042598.社交焦虑","2022042599.态度"]
const 编程架构=
["202204251.POP","202204252.OOP","202204253.AOP","202204254.SOA","202204255.分布式","202204256.微服务"]



module.exports = {
  base: '/',
  title: 'woyaodangrapper',
  description: 'https://blog.taoistcore.com',
  head: [
    ['link', { rel: 'icon', href: '/logo.ico' }]
  ],
  themeConfig: {
    nav: [
      { text: '首页', link: '/' },
      { text: '西奥迪尼社会心理学', link: encodeURI('/architecture/西奥迪尼社会心理学SOCIALPSYCHOLOGYGOALSININTERACTION/')},
      { text: '编程架构', link: encodeURI('/architecture/编程架构SYSTEMSARCHITECTURE/')},
      { text: 'Github', link: 'https://github.com/light-come/blog' } //,
      /**
       {
          text: 'Languages',
          items: [
            { text: '中文', link: '/language/chinese' },
            { text: 'English', link: '/language/english' }
          ]
        }
      **/

    ],

    sidebar: {
      '/architecture/西奥迪尼社会心理学SOCIALPSYCHOLOGYGOALSININTERACTION/': [
        {
          title: '西奥迪尼社会心理学',
          collapsable: false,
          children: 西奥迪尼社会心理学
        }
      ], 
      '/architecture/编程架构SYSTEMSARCHITECTURE/': [
        {
          title: '编程架构',
          collapsable: false,
          children: 编程架构
        }
      ],
      // fallback
      '/': [
        ''
      ]
    },
    lastUpdated: '上次更新'
  },
  markdown: {
    lineNumbers: true
  },
  plugins: [
    ['@vuepress/back-to-top', true],
    [
      '@vuepress/last-updated',
      {
        transformer: (timestamp, lang) => {
          // 不要忘了安装 moment
          const moment = require('moment')
          moment.locale('zh-cn')
          return moment(timestamp).fromNow();
        }
      }
    ]
  ],
};